1s/ERP/Conf/Documents/Лико_ЗаказОснастки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаказОснастки</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлощадкаУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОперацийЗаказОснастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУдалить</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оснастка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидШтампа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_СтатусыЗаказовНаОснастку</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тираж</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаЭтикетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаЭтикетки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШагПечати</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Z</Name>
							<Comment>Количество зубьев</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ZКоличествоЗубьев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтикетокНаЛисте</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ручьи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалМеждуРучьями</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалМеждуЭтикетками</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеНамотки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Намотка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диаметр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Радиус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВырубки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипыВырубки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИнструмента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ТипИнструмента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПечати</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыПечати</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЦветов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаРукава</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подложка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Подложка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Comment>Рабочий центр для Omega</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>_3DМодель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Книжка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вклейка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудозатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разработчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказНаПроизводство</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнутреннийЗаказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этикетки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этикетка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЗаказыНаОснастку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЗаказыНаОснастку</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаказовНаОснастку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаОснастку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаказОснастки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСтроки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусыЗаказовНаОснастку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусыЗаказовНаОснастку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Размещен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннийЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_НаправленияПротяжки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_НаправленияПротяжки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продольное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поперечное</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаказОснастки/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаказОснасткиОснастка.Ссылка КАК Ссылка,
	|	Лико_ЗаказОснасткиОснастка.Номенклатура КАК Номенклатура,
	|	Лико_ЗаказОснасткиОснастка.Количество КАК Количество,
	|	Лико_ЗаказОснасткиОснастка.Менеджер КАК Менеджер,
	|	Лико_ЗаказОснасткиОснастка.Заказ КАК Заказ,
	|	Лико_ЗаказОснасткиОснастка.Статус КАК Статус,
	|	Лико_ЗаказОснасткиОснастка.Примечание КАК Примечание,
	|	Лико_ЗаказОснасткиОснастка.КлючСтроки КАК КлючСтроки,
	|	Лико_ЗаказОснасткиОснастка.ЗаказНаПроизводство КАК ВнутреннийЗаказ
	|ИЗ
	|	Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ЗаказыНаОснастку КАК Лико_ЗаказыНаОснастку
	|		ПО Лико_ЗаказОснасткиОснастка.КлючСтроки = Лико_ЗаказыНаОснастку.КлючСтроки
	|			И Лико_ЗаказОснасткиОснастка.Ссылка = Лико_ЗаказыНаОснастку.ЗаказНаОснастку
	|			И Лико_ЗаказОснасткиОснастка.Статус = Лико_ЗаказыНаОснастку.Статус
	|ГДЕ
	|	Лико_ЗаказыНаОснастку.ЗаказНаОснастку ЕСТЬ NULL
	|	И Лико_ЗаказОснасткиОснастка.Ссылка = &ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ОтправлятьПисьмо = Ложь;
	Пока Выборка.Следующий() Цикл
		Запись 					= РегистрыСведений.Лико_ЗаказыНаОснастку.СоздатьМенеджерЗаписи();
		Запись.Период 			= ТекущаяДата();
		Запись.ЗаказНаОснастку 	= Ссылка;
		Запись.Заказ 			= Выборка.Заказ;
		Запись.Менеджер 		= Выборка.Менеджер;
		Запись.Номенклатура 	= Выборка.Номенклатура;
		Запись.Статус 			= Выборка.Статус;
		Запись.Количество 		= Выборка.Количество;
		Запись.Примечание 		= Выборка.Примечание;
		Запись.КлючСтроки 		= Выборка.КлючСтроки;
		Запись.ВнутреннийЗаказ 	= Выборка.ВнутреннийЗаказ;

		Запись.Ответственный 	= Пользователи.ТекущийПользователь();
		Запись.Записать();
		Если Выборка.Статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Подтвержден Тогда 
			ОтправлятьПисьмо = Истина;
		КонецЕсли;	
	КонецЦикла;
	
	//Дозаполним записи, если они изменились (были удалены или добавлены номенклатура, заказ и т.д.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ЗаказыНаОснастку.Номенклатура КАК Номенклатура,
	|	Лико_ЗаказыНаОснастку.Период КАК Период,
	|	Лико_ЗаказыНаОснастку.Менеджер КАК Менеджер,
	|	Лико_ЗаказыНаОснастку.Заказ КАК Заказ,
	|	Лико_ЗаказыНаОснастку.ЗаказНаОснастку КАК ЗаказНаОснастку,
	|	Лико_ЗаказыНаОснастку.КлючСтроки КАК КлючСтроки,
	|	Лико_ЗаказыНаОснастку.ВнутреннийЗаказ КАК ВнутреннийЗаказ
	|ПОМЕСТИТЬ ВТЗаписей
	|ИЗ
	|	РегистрСведений.Лико_ЗаказыНаОснастку КАК Лико_ЗаказыНаОснастку
	|ГДЕ
	|	Лико_ЗаказыНаОснастку.ЗаказНаОснастку = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаписей.ЗаказНаОснастку КАК ЗаказНаОснастку,
	|	ВТЗаписей.КлючСтроки КАК КлючСтроки,
	|	ВТЗаписей.Номенклатура КАК Номенклатура,
	|	ВТЗаписей.Период КАК Период,
	|	ВТЗаписей.Менеджер КАК Менеджер,
	|	ВТЗаписей.Заказ КАК Заказ,
	|	Лико_ЗаказОснасткиОснастка.Менеджер КАК Менеджер1,
	|	Лико_ЗаказОснасткиОснастка.Заказ КАК Заказ1,
	|	Лико_ЗаказОснасткиОснастка.Номенклатура КАК Номенклатура1,
	|	Лико_ЗаказОснасткиОснастка.Ссылка КАК Ссылка,
	|	ВТЗаписей.ВнутреннийЗаказ КАК ВнутреннийЗаказ
	|ИЗ
	|	ВТЗаписей КАК ВТЗаписей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
	|		ПО (Лико_ЗаказОснасткиОснастка.Ссылка = ВТЗаписей.ЗаказНаОснастку)
	|			И (Лико_ЗаказОснасткиОснастка.КлючСтроки = ВТЗаписей.КлючСтроки)
	|ГДЕ
	|	(ВТЗаписей.Менеджер <> Лико_ЗаказОснасткиОснастка.Менеджер
	|			ИЛИ ВТЗаписей.Заказ <> Лико_ЗаказОснасткиОснастка.Заказ
	|			ИЛИ ВТЗаписей.Номенклатура <> Лико_ЗаказОснасткиОснастка.Номенклатура
	|			ИЛИ Лико_ЗаказОснасткиОснастка.Ссылка ЕСТЬ NULL)";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда 
			Запись 					= РегистрыСведений.Лико_ЗаказыНаОснастку.СоздатьМенеджерЗаписи();
			Запись.Период 			= Выборка.Период;
			Запись.ЗаказНаОснастку 	= Ссылка;
			Запись.Ключстроки	 	= Выборка.КлючСтроки;
			Запись.Заказ 			= Выборка.Заказ;
			Запись.Менеджер 		= Выборка.Менеджер;
			Запись.Номенклатура 	= Выборка.Номенклатура;
			Запись.ВнутреннийЗаказ 	= Выборка.ВнутреннийЗаказ;

			Запись.Прочитать();
			Запись.Период 			= Выборка.Период;
			Запись.ЗаказНаОснастку 	= Ссылка;
			Запись.Ключстроки	 	= Выборка.КлючСтроки;
			Запись.ВнутреннийЗаказ 	= Выборка.ВнутреннийЗаказ;
			Запись.Заказ 			= Выборка.Заказ1;
			Запись.Менеджер 		= Выборка.Менеджер1;
			Запись.Номенклатура 	= Выборка.Номенклатура1;
			Запись.Записать();
		КонецЕсли;
			
	КонецЦикла;

	// --> Маковеева А.Ю. 01.08.2018
	//ищем параметры штампов с пустыми реквизитами "Менеджер", "Партнер" и "Заказ" и заполняем их
	
	ТЗ_Оснастка = Оснастка.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ_Оснастка.Номенклатура КАК Номенклатура,
		|	ТЗ_Оснастка.Партнер КАК Партнер,
		|	ТЗ_Оснастка.Менеджер КАК Менеджер,
		|	ТЗ_Оснастка.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_Оснастка
		|ИЗ
		|	&ТЗ_Оснастка КАК ТЗ_Оснастка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Оснастка.Номенклатура КАК Номенклатура,
		|	ВТ_Оснастка.Партнер КАК Партнер,
		|	ВТ_Оснастка.Менеджер КАК Менеджер,
		|	ВТ_Оснастка.Заказ КАК Заказ
		|ИЗ
		|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Оснастка КАК ВТ_Оснастка
		|		ПО Лико_ПараметрыШтампа.Номенклатура = ВТ_Оснастка.Номенклатура
		|ГДЕ
		|	Лико_ПараметрыШтампа.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|	И Лико_ПараметрыШтампа.Менеджер = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|	И Лико_ПараметрыШтампа.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТЗ_Оснастка", ТЗ_Оснастка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШтампов = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаШтампов.Следующий() Цикл
		
		НЗ_ПараметрыШтампа = РегистрыСведений.Лико_ПараметрыШтампа.СоздатьНаборЗаписей();
		НЗ_ПараметрыШтампа.Отбор.Номенклатура.Установить(ВыборкаШтампов.Номенклатура);
		НЗ_ПараметрыШтампа.Прочитать();
		
		Для Каждого ПараметрыШтампа Из НЗ_ПараметрыШтампа Цикл
			ЗаполнитьЗначенияСвойств(ПараметрыШтампа, ВыборкаШтампов, "Заказ, Партнер, Менеджер"); 	
		КонецЦикла;
		
		Попытка
			НЗ_ПараметрыШтампа.Записать();
		Исключение
			Сообщить("Произошла ошибка при заполнении параметров штампа " + Строка(ВыборкаШтампов.Номенклатура) + " (" + Строка(ВыборкаШтампов.Номенклатура.Код) + ")");
		КонецПопытки;
		
	КонецЦикла;
	// <-- Маковеева А.Ю. 01.08.2018
	
	Если ОтправлятьПисьмо Тогда 
		Адресат = Справочники.Лико_ПредопределенныеЗначения.ПользовательОтветственныйЗаОснастку.ЗначениеПараметра;
		Если ЗначениеЗаполнено(Адресат) Тогда 
			НомерЗаказаОснастки = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Ссылка.Номер);
			текст = "Подтвержден заказ на оснастку N " +НомерЗаказаОснастки+" пользователем "+Пользователи.ТекущийПользователь()  ;
			Тема = "Подтвержден заказ на оснастку N " +НомерЗаказаОснастки+ " вид: "+ВидОперации;
			Лико_Планирование.ОтправитьПисьмо(текст, Тема, Адресат) ;
		КонецЕсли;	
	КонецЕсли;	

	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") 
		//+ Лико m.shenderov 15.09.2021
		
		Или (ТипЗнч(ДанныеЗаполнения)=Тип("Структура") И ДанныеЗаполнения.Свойство("Заказ")) Тогда
		
		МассивНоменклатур=Новый Массив;
		
		Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
			Заказ = ДанныеЗаполнения.Заказ;
			МассивНоменклатур= ?(ДанныеЗаполнения.Свойство("МассивНоменклатур"),ДанныеЗаполнения.МассивНоменклатур,МассивНоменклатур);
		Иначе
			Заказ = ДанныеЗаполнения;
		КонецЕсли;
		//- Лико m.shenderov 15.09.2021
		
		//ИначеЕсли  ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.СпецификацииНоменклатуры") Тогда
		//	ЗаполнитьПоСпецификации(ДанныеЗаполнения,1);
		//ИначеЕсли  ТипЗнч(ДанныеЗаполнения) = Тип("Структура")  Тогда
		//	Если ДанныеЗаполнения.Свойство("Заказ") Тогда 
		// Заполнение шапки
		Ответственный = Пользователи.ТекущийПользователь();
		Площадка = Заказ.Площадка;
		//ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ;
		//ЗаказНового = Ложь;
		ЗапросНом =Новый Запрос;
		ЗапросНом.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказПокупателяТовары.Номенклатура
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Заказ";
		ЗапросНом.УстановитьПараметр("Заказ", Заказ);
		ТЗНом = ЗапросНом.Выполнить().Выгрузить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаЦвета.НомерСтроки) КАК КоличествоЦветов,
		|	ЗаказКлиентаЦвета.Ссылка КАК Заказ
		|ПОМЕСТИТЬ ТабЦветов
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаЦвета
		|ГДЕ
		|	ЗаказКлиентаЦвета.Ссылка = &Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаЦвета.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское)
		|			ТОГДА ВЫБОР
		|					КОГДА ЗаказКлиентаВидыРабот.НаправлениеПротяжки = ЗНАЧЕНИЕ(Перечисление.Лико_НаправленияПротяжки.Поперечное)
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
		|				КОНЕЦ
		|		ИНАЧЕ ЗаказКлиентаВидыРабот.ВидСекции.ВидРабот
		|	КОНЕЦ КАК ВидРабот,
		|	ЗаказКлиентаВидыРабот.РабочийЦентр КАК РабочийЦентр,
		|	ЗаказКлиентаВидыРабот.Оснастка КАК Номенклатура,
		|	ЗаказКлиентаВидыРабот.ЗаказНовойОснастки КАК ЗаказНовойОснастки,
		|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал КАК Материал,
		|	ЗаказКлиентаВидыРабот.Ссылка.Партнер КАК Партнер,
		|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал КАК ОсновнойМатериал,
		|	ЗаказКлиентаВидыРабот.Ссылка.МетражПМ КАК МетражПМ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Нарезка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказКлиентаВидыРабот.Нарезка <> ЗНАЧЕНИЕ(Справочник.Яссм_Нарезки.ПустаяСсылка)
		|					ТОГДА ЗаказКлиентаВидыРабот.Нарезка
		|				ИНАЧЕ Лико_ПараметрыШтампа.Нарезка
		|			КОНЕЦ
		|	КОНЕЦ КАК Нарезка,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛисте
		|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокНаЛисте
		|	КОНЕЦ КАК ЭтикетокНаЛисте,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШагПечати
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
		|						И ЗаказКлиентаВидыРабот.КоличествоРучьевНумератора <> 0
		|					ТОГДА ЗаказКлиентаВидыРабот.КоличествоРучьевНумератора
		|				КОГДА ЗаказКлиентаВидыРабот.Подача <> 0
		|					ТОГДА ЗаказКлиентаВидыРабот.Подача
		|				ИНАЧЕ Лико_ПараметрыШтампа.ШагПечати
		|			КОНЕЦ
		|	КОНЕЦ КАК ШагПечати,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Ручьи
		|		ИНАЧЕ Лико_ПараметрыШтампа.Ручьи
		|	КОНЕЦ КАК Ручьи,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ДлинаЭтикетки
		|		ИНАЧЕ Лико_ПараметрыШтампа.ДлинаЭтикетки
		|	КОНЕЦ КАК ДлинаЭтикетки,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШиринаЭтикетки
		|		ИНАЧЕ Лико_ПараметрыШтампа.ШиринаЭтикетки
		|	КОНЕЦ КАК ШиринаЭтикетки,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Z
		|		ИНАЧЕ Лико_ПараметрыШтампа.Z
		|	КОНЕЦ КАК Z,
		|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями КАК ИнтервалМеждуРучьями,
		|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками КАК ИнтервалМеждуЭтикетками,
		|	ЗаказКлиентаВидыРабот.Ссылка.Менеджер КАК Менеджер,
		|	ТабЦветов.КоличествоЦветов КАК КоличествоЦветов,
		|	ЗаказКлиентаВидыРабот.Ссылка КАК Заказ,
		|	ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра КАК ВидРЦ,
		|	ЗаказКлиентаВидыРабот.Ссылка.Тираж КАК Тираж,
		|	ЗаказКлиентаВидыРабот.Ссылка.Регион КАК Регион
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаВидыРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
		|		ПО ЗаказКлиентаВидыРабот.Оснастка = Лико_ПараметрыШтампа.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦветов КАК ТабЦветов
		|		ПО ЗаказКлиентаВидыРабот.Ссылка = ТабЦветов.Заказ
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|	И (ЗаказКлиентаВидыРабот.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ИЛИ ЗаказКлиентаВидыРабот.ЗаказНовойОснастки = ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.ГорячееТиснениеПлоское)
		|			ТОГДА ВЫБОР
		|					КОГДА ЗаказКлиентаВидыРабот.НаправлениеПротяжки = ЗНАЧЕНИЕ(Перечисление.Лико_НаправленияПротяжки.Поперечное)
		|						ТОГДА ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПоперечное)
		|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ГорячееТиснениеПлоскоеПродольное)
		|				КОНЕЦ
		|		ИНАЧЕ ЗаказКлиентаВидыРабот.ВидСекции.ВидРабот
		|	КОНЕЦ,
		|	ЗаказКлиентаВидыРабот.РабочийЦентр,
		|	Ном.Ссылка,
		|	ЗаказКлиентаВидыРабот.ЗаказНовойОснастки,
		|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал,
		|	ЗаказКлиентаВидыРабот.Ссылка.Партнер,
		|	ЗаказКлиентаВидыРабот.Ссылка.ОсновнойМатериал,
		|	ЗаказКлиентаВидыРабот.Ссылка.МетражПМ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Нарезка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказКлиентаВидыРабот.Нарезка <> ЗНАЧЕНИЕ(Справочник.Яссм_Нарезки.ПустаяСсылка)
		|					ТОГДА ЗаказКлиентаВидыРабот.Нарезка
		|				ИНАЧЕ Лико_ПараметрыШтампа.Нарезка
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ЭтикетокНаЛисте
		|		ИНАЧЕ Лико_ПараметрыШтампа.ЭтикетокНаЛисте
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШагПечати
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказКлиентаВидыРабот.ВидСекции = ЗНАЧЕНИЕ(Справочник.Лико_ВидыСекций.Нумератор)
		|						И ЗаказКлиентаВидыРабот.КоличествоРучьевНумератора <> 0
		|					ТОГДА ЗаказКлиентаВидыРабот.КоличествоРучьевНумератора
		|				КОГДА ЗаказКлиентаВидыРабот.Подача <> 0
		|					ТОГДА ЗаказКлиентаВидыРабот.Подача
		|				ИНАЧЕ Лико_ПараметрыШтампа.ШагПечати
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Ручьи
		|		ИНАЧЕ Лико_ПараметрыШтампа.Ручьи
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ДлинаЭтикетки
		|		ИНАЧЕ Лико_ПараметрыШтампа.ДлинаЭтикетки
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.ШиринаЭтикетки
		|		ИНАЧЕ Лико_ПараметрыШтампа.ШиринаЭтикетки
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаВидыРабот.Оснастка = ЗаказКлиентаВидыРабот.Ссылка.ШтампВырубной
		|			ТОГДА ЗаказКлиентаВидыРабот.Ссылка.Z
		|		ИНАЧЕ Лико_ПараметрыШтампа.Z
		|	КОНЕЦ,
		|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями,
		|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками,
		|	ЗаказКлиентаВидыРабот.Ссылка.Менеджер,
		|	ТабЦветов.КоличествоЦветов,
		|	ЗаказКлиентаВидыРабот.Ссылка,
		|	ЗаказКлиентаВидыРабот.РабочийЦентр.ВидРабочегоЦентра,
		|	ЗаказКлиентаВидыРабот.Ссылка.Тираж,
		|	ЗаказКлиентаВидыРабот.Ссылка.Регион
		|ИЗ
		|	Документ.ЗаказКлиента.Цвета КАК ЗаказКлиентаВидыРабот
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦветов КАК ТабЦветов
		|		ПО ЗаказКлиентаВидыРабот.Ссылка = ТабЦветов.Заказ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
		|			ПО Ном.Ссылка = Лико_ПараметрыШтампа.Номенклатура
		|		ПО ЗаказКлиентаВидыРабот.Оснастка.Артикул = Ном.Артикул
		|			И ЗаказКлиентаВидыРабот.Оснастка.Артикул = Ном.Артикул
		|			И (Ном.Наименование ПОДОБНО ""%контрматрица%""
		|				ИЛИ Ном.Наименование ПОДОБНО ""%кондуктор%"")
		|ГДЕ
		|	ЗаказКлиентаВидыРабот.Ссылка = &Заказ
		|	И (ЗаказКлиентаВидыРабот.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ИЛИ ЗаказКлиентаВидыРабот.ЗаказНовойОснастки = ИСТИНА)";
		
		Документы.Лико_ЗаказОснастки.ТекстЗапросаОснасткаНаЗаказ(Запрос.Текст); 

		Запрос.УстановитьПараметр("Заказ", Заказ);
		Выборка = Запрос.Выполнить().Выбрать();
		ФилтрПоНоменклатуре=МассивНоменклатур.Количество()>0;
		Пока Выборка.Следующий() Цикл
			//+ Лико m.shenderov 15.09.2021
			Пропустить=Ложь;
			Если ФилтрПоНоменклатуре И МассивНоменклатур.Найти(Выборка.Номенклатура)=Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			//- Лико m.shenderov 15.09.2021
			стр = Оснастка.Добавить();
			стр.Статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Создан;
			ЗаполнитьЗначенияСвойств(стр, Выборка);
			стр.количество = 1;
			стр.ВидШтампа = Выборка.ВидРабот;
			КлючСтроки = Новый УникальныйИдентификатор;
			стр.ключстроки = КлючСтроки;
			Для каждого стрНом Из ТЗНом Цикл
				стрЭт = Этикетки.Добавить();
				стрЭт.Этикетка = СтрНом.Номенклатура;
				стрЭт.КлючСтроки = стр.ключСтроки;
			КонецЦикла;
			
			Если Выборка.ЗаказНовойОснастки Тогда 
				ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Новый;
			ИначеЕсли ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
				ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ;
			КонецЕсли;
			
			Если Выборка.Количество()>1 Тогда
				ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ;
			КонецЕсли;
		КонецЦикла;	
		//ИначеЕсли  ДанныеЗаполнения.Свойство("Спецификация")  И ДанныеЗаполнения.Свойство("НомерВарианта") Тогда 
		//	ЗаполнитьПоСпецификации(ДанныеЗаполнения.Спецификация,ДанныеЗаполнения.НомерВарианта);
		//	
		//КонецЕсли;	
	КонецЕсли;
	
	
	
КонецПроцедуры	

Процедура ЗаполнитьПоСпецификации(ДанныеЗаполнения,НомерВарианта)
	
	//Ответственный = Пользователи.ТекущийПользователь();
	////Площадка = ДанныеЗаполнения.Заказ.Площадка;
	//ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Перезаказ;
	//ЗапросНом =Новый Запрос;
	//	ЗапросНом.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	СпецификацииНоменклатурыВыходныеИзделия.Номенклатура
	//	|ИЗ
	//	|	Справочник.СпецификацииНоменклатуры.ВыходныеИзделия КАК СпецификацииНоменклатурыВыходныеИзделия
	//	|ГДЕ
	//	|	СпецификацииНоменклатурыВыходныеИзделия.Ссылка = &ссылка";
	//	ЗапросНом.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	//	ТЗНом = ЗапросНом.Выполнить().Выгрузить();
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СпецификацииНоменклатурыЦвета.НомерСтроки) КАК КоличествоЦветов,
	//	|	СпецификацииНоменклатурыЦвета.Ссылка КАК Спецификация
	//	|ПОМЕСТИТЬ ТабЦветов
	//	|ИЗ
	//	|	Справочник.СпецификацииНоменклатуры.Цвета КАК СпецификацииНоменклатурыЦвета
	//	|ГДЕ
	//	|	СпецификацииНоменклатурыЦвета.Ссылка = &Спецификация
	//	|	И СпецификацииНоменклатурыЦвета.НомерВарианта = &НомерВарианта
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	СпецификацииНоменклатурыЦвета.Ссылка
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	СпецификацииНоменклатурыВидыРабот.РабочийЦентр.Лико_Тип.ВидПечати КАК ВидПечати,
	//	|	СпецификацииНоменклатурыВидыРабот.Ссылка КАК Спецификация
	//	|ПОМЕСТИТЬ ТабВидПечати
	//	|ИЗ
	//	|	Справочник.СпецификацииНоменклатуры.ВидыРабот КАК СпецификацииНоменклатурыВидыРабот
	//	|ГДЕ
	//	|	СпецификацииНоменклатурыВидыРабот.Ссылка = &Спецификация
	//	|	И СпецификацииНоменклатурыВидыРабот.НомерВарианта = &НомерВарианта
	//	|	И СпецификацииНоменклатурыВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.ПервыйПрокат)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СпецификацииНоменклатурыВидыРабот.ВидРабот,
	//	|	СпецификацииНоменклатурыВидыРабот.РабочийЦентр,
	//	|	СпецификацииНоменклатурыВидыРабот.Оснастка КАК Номенклатура,
	//	|	СпецификацииНоменклатурыВидыРабот.ЗаказНовойОснастки,
	//	|	СпецификацииНоменклатурыВидыРабот.Материал,
	//	|	СпецификацииНоменклатурыВидыРабот.Нарезка КАК Нарезка,
	//	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.ЭтикетокНаЛисте, Лико_ПараметрыШтампа.ЭтикетокНаЛисте) КАК ЭтикетокНаЛисте,
	//	|	СпецификацииНоменклатурыПараметрыШтампа.ШиринаРулона,
	//	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.Ручьи, Лико_ПараметрыШтампа.Ручьи) КАК Ручьи,
	//	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.Z, Лико_ПараметрыШтампа.Z) КАК Z,
	//	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.ШагПечати, Лико_ПараметрыШтампа.ШагПечати) КАК ШагПечати,
	//	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.ДлинаЭтикетки, Лико_ПараметрыШтампа.ДлинаЭтикетки) КАК ДлинаЭтикетки,
	//	|	ЕСТЬNULL(СпецификацииНоменклатурыПараметрыШтампа.ШиринаЭтикетки, Лико_ПараметрыШтампа.ШиринаЭтикетки) КАК ШиринаЭтикетки,
	//	|	СпецификацииНоменклатурыПараметрыШтампа.ВидШтампа,
	//	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями,
	//	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками,
	//	|	ЕСТЬNULL(ТабЦветов.КоличествоЦветов, 0) КАК КоличествоЦветов,
	//	|	ТабВидПечати.ВидПечати,
	//	|	СпецификацииНоменклатурыВидыРабот.Ссылка.Ответственный КАК Менеджер,
	//	|	СпецификацииНоменклатурыВидыРабот.РабочийЦентр.Площадка КАК Площадка,
	//	|	СпецификацииНоменклатурыВидыРабот.Ссылка.ОсновнойМатериал
	//	|ИЗ
	//	|	Справочник.СпецификацииНоменклатуры.ВидыРабот КАК СпецификацииНоменклатурыВидыРабот
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.ПараметрыШтампа КАК СпецификацииНоменклатурыПараметрыШтампа
	//	|		ПО СпецификацииНоменклатурыВидыРабот.Ссылка = СпецификацииНоменклатурыПараметрыШтампа.Ссылка
	//	|			И СпецификацииНоменклатурыВидыРабот.НомерВарианта = СпецификацииНоменклатурыПараметрыШтампа.НомерВарианта
	//	|			И (СпецификацииНоменклатурыВидыРабот.Оснастка = СпецификацииНоменклатурыПараметрыШтампа.ШтампВырубной
	//	|				ИЛИ СпецификацииНоменклатурыВидыРабот.ВидРабот = ЗНАЧЕНИЕ(Справочник.ТехнологическиеОперации.Вырубка)
	//	|					И СпецификацииНоменклатурыВидыРабот.ЗаказНовойОснастки = ИСТИНА)
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	//	|		ПО СпецификацииНоменклатурыВидыРабот.Оснастка = Лико_ПараметрыШтампа.Номенклатура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЦветов КАК ТабЦветов
	//	|		ПО СпецификацииНоменклатурыВидыРабот.Ссылка = ТабЦветов.Спецификация
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабВидПечати КАК ТабВидПечати
	//	|		ПО СпецификацииНоменклатурыВидыРабот.Ссылка = ТабВидПечати.Спецификация
	//	|ГДЕ
	//	|	СпецификацииНоменклатурыВидыРабот.Ссылка = &Спецификация
	//	|	И СпецификацииНоменклатурыВидыРабот.НомерВарианта = &НомерВарианта
	//	|	И (СпецификацииНоменклатурыВидыРабот.Оснастка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	//	|			ИЛИ СпецификацииНоменклатурыВидыРабот.ЗаказНовойОснастки = ИСТИНА)";
	//	Запрос.УстановитьПараметр("Спецификация", ДанныеЗаполнения);
	//	Запрос.УстановитьПараметр("НомерВарианта", НомерВарианта);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Площадка = Выборка.Площадка;
	//		стр = Оснастка.Добавить();
	//		стр.Статус = Перечисления.Лико_СтатусыЗаказовНаОснастку.Создан;
	//		ЗаполнитьЗначенияСвойств(стр, Выборка);
	//		стр.количество = 1;
	//		стр.ВидШтампа = Выборка.ВидРабот;
	//		стр.ключстроки = Лико_Планирование.ПолучитьНовыйКлючСтроки("Оснастка", ЭтотОбъект);
	//		Если Выборка.ВидРабот <> Справочники.ТехнологическиеОперации.Вырубка Тогда
	//			стр.ШиринаРулона = Выборка.Нарезка;
	//		Иначе
	//			стр.Материал = Выборка.ОсновнойМатериал;
	//		КонецЕсли;
	//		Для каждого стрНом Из ТЗНом Цикл
	//			стрЭт = Этикетки.Добавить();
	//			стрЭт.Этикетка = СтрНом.Номенклатура;
	//			стрЭт.КлючСтроки = стр.ключСтроки;
	//		КонецЦикла;
	//		Если Выборка.ЗаказНовойОснастки Тогда 
	//			ВидОперации = Перечисления.Лико_ВидыОперацийЗаказОснастки.Новый;
	//		КонецЕсли;
	//		
	//	КонецЦикла;		
КонецПроцедуры

Функция ЭлектроныеАдресаОтвественныхЗаЗаявкиНаОснастку(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	  |	Лико_ЗаказОснасткиОснастка.Номенклатура КАК Номенклатура,
	  |	МАКСИМУМ(Лико_ЗаказОснасткиОснастка.Ссылка.Дата) КАК Дата
	  |ПОМЕСТИТЬ втДатыПоследнихЗаказов
	  |ИЗ
	  |	Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
	  |ГДЕ
	  |	Лико_ЗаказОснасткиОснастка.Номенклатура В(&Номенклатура)
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	Лико_ЗаказОснасткиОснастка.Номенклатура
	  |;
	  |
	  |////////////////////////////////////////////////////////////////////////////////
	  |ВЫБРАТЬ
	  |	Лико_ЗаказОснасткиОснастка.Ссылка КАК Ссылка,
	  |	Лико_ЗаказОснасткиОснастка.Номенклатура КАК Номенклатура,
	  |	втДатыПоследнихЗаказов.Дата КАК Дата,
	  |	Лико_ЗаказОснасткиОснастка.Ссылка.Ответственный КАК Ответственный
	  |ИЗ
	  |	втДатыПоследнихЗаказов КАК втДатыПоследнихЗаказов
	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Лико_ЗаказОснастки.Оснастка КАК Лико_ЗаказОснасткиОснастка
	  |		ПО втДатыПоследнихЗаказов.Дата = Лико_ЗаказОснасткиОснастка.Ссылка.Дата
	  |			И втДатыПоследнихЗаказов.Номенклатура = Лико_ЗаказОснасткиОснастка.Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Ответственные = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ответственный");
	Емайлы = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Ответственные,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,Справочники.ВидыКонтактнойИнформации.EmailПользователя);
КонецФункции
